import math
import time

#Можна використати math.e з бібліотеки "math"
e = 2.7182818284590455

#Початкові значення змінних за формулою
x = 1
n = 1

print("\nЗначення e: " + str(e) + "\n")

while x != e:

    x += 1 / math.factorial(n)
    n += 1

    #Затримка для зручнішого перегляду у консолі
    time.sleep(1)

#Технічне завдання
    if n != 5:
        print("Поточне значення х №" + str(n) + ": " + str(x))
    else:
        continue

#    if n != 5:
#        print("Поточне значення х: " + str(x))
#    else:
#        print("5 ЕЛЕМЕНТ ПРОПУЩЕНО!")

#Додаткове повідомлення про успішне завершення програми
if x == e:
    print("\nТепер х = е! Щоб перетворити х на е, знадобилося зробити {} дій!".format(n))
